Revit 2026 API

# MetallicPaintMetallicpaintFlecksSize Property

---

The property labeled "Size" from the "MetallicPaint" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MetallicpaintFlecksSize { get; }
```
```vb
Public Shared ReadOnly Property MetallicpaintFlecksSize As String
	Get
```
```cpp
public:
static property String^ MetallicpaintFlecksSize {
	String^ get ();
}
```
```fsharp
static member MetallicpaintFlecksSize : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 1".

#### Reference

MetallicPaint Class

Autodesk.Revit.DB.Visual Namespace